[
    {
        "set_name": "SSC CGL Set 1",
        "difficulty_type": "easy",
        "task_type": "descriptive",
        "data": [
            {
                "question": "Write an essay on 'Importance of education in present time'. (250 words)"
            },
            {
                "question": "You are Sunita/Sunil, resident of Gandhi road, Dwarka, New Delhi, 110083, write a letter to manager, G D resaurant complaining about their poor service and the quality of food. (150 words)"
            }
        ]
    },
    {
        "set_name": "SSC CGL Set 1",
        "difficulty_type": "medium",
        "task_type": "descriptive",
        "data": [
            {
                "question": "Write an essay on 'In the event of earthquake, for your safety what you should do and what should you not do?' (250 words)"
            },
            {
                "question": "Assuming that you are Suresh/Seema, write a letter to your younger brother Naresh, highlighting the distinct benefits and shortcomings of Computer Based Recruitment test, and what will be the future shortfall of it. (150 words)"
            }
        ]
    },
    {
        "set_name": "SSC CGL Set 1",
        "difficulty_type": "hard",
        "task_type": "descriptive",
        "data": [
            {
                "question": "Write an essay on 'Charity benefits not only receiver but also giver' (250 words)"
            },
            {
                "question": "Precis this passage in 100-150 words: A society is a grouping of individuals, which is characterized by common interest and may have distinctive culture and institutions. 'Society' may refer to a particular people, such as the Nuer, to a nation state, such as Switzerland, or to a broader cultural group, such as Western society. Society can also be explained as an organized group of people associated together for religious, benevolent, cultural, scientific, political, patriotic, or other purposes. The English word society emerged in the 15th century and is derived from the French société. The French word, in turn, had its origin in the Latin societal, a 'friendly association with others,' from socius meaning 'companion, associate, comrade or business partner.' Implicit in the meaning of society is that its members share some mutual concern or interest, a common objective or common characteristics. In political science, the term is often used to mean the totality of human relationships, generally in contrast to the State, i.e., the apparatus of rule or government within a territory: 'I mean by it [the State] that summation of privileges and dominating positions which are brought into being by extra-economic power... I mean by Society, the totality of concepts of all purely natural relations and institutions between man and man...'"
            }
        ]
    },
    {
        "set_name": "SSC CGL Set 2",
        "difficulty_type": "easy",
        "task_type": "descriptive",
        "data": [
            {
                "question": "Write an essay on 'Population Control is the answer to all the problems.' (250 words)"
            },
            {
                "question": "Letter to your younger brother to tell him the Excessive use of cell phones. (150 words)"
            }
        ]
    },
    {
        "set_name": "SSC CGL Set 2",
        "difficulty_type": "medium",
        "task_type": "descriptive",
        "data": [
            {
                "question": "Write an essay on 'Old age & social security'  (250 words)"
            },
            {
                "question": "You are Mahima/jaspreet, a resident of Lodhi Road, New Delhi. Write a letter in 150 words to your younger brother Tinku, convincing him that if he/she wants to build a good career for himself/herself, then he/she should leave all the things that are distracting him/her from their goal and suggest him/her to focus on his/her studies. (150 words)"
            }
        ]
    },
    {
        "set_name": "SSC CGL Set 2",
        "difficulty_type": "hard",
        "task_type": "descriptive",
        "data": [
            {
                "question": "Write an essay on 'How far demonetization has achieved its objective?' (250 words)"
            },
            {
                "question": "Assuming that you are Rajani/Rajan and you  have been selected as the Marketing Manager in a Public Enterprises and have to join immediately. Write a letter to your senior to extend the Date of Joining. (150 words)"
            }
        ]
    },
    {
        "set_name": "SSC CGL Set 3",
        "difficulty_type": "easy",
        "task_type": "descriptive",
        "data": [
            {
                "question": "Write an essay on 'Role of Women in Nation Building'. (250 words)"
            },
            {
                "question": "You are Rahul/Meera, a resident of Shanti Nagar, Lucknow. Write a letter to the Editor of a local newspaper, highlighting the issue of potholes on roads and the accidents caused due to it. (150 words)"
            }
        ]
    },
    {
        "set_name": "SSC CGL Set 3",
        "difficulty_type": "medium",
        "task_type": "descriptive",
        "data": [
            {
                "question": "Write an essay on 'Impact of Climate Change on Agriculture'. (250 words)"
            },
            {
                "question": "Precis this passage in 100-150 words: A government is necessary for the stability and development of a country. It ensures law and order, implements policies for the welfare of the citizens, and defends the country from external threats. Over time, governments have evolved from monarchies to democracies in many parts of the world, with the aim of providing a better representation of people's needs. However, corruption, inefficiency, and lack of accountability are common challenges. A good government is one that is transparent, inclusive, and responsive to its citizens' concerns while fostering economic and social progress."
            }
        ]
    },
    {
        "set_name": "SSC CGL Set 3",
        "difficulty_type": "hard",
        "task_type": "descriptive",
        "data": [
            {
                "question": "Write an essay on 'E-governance: Its Advantages and Challenges'. (250 words)"
            },
            {
                "question": "You are Arvind/Sneha, a student preparing for competitive exams. Write a letter to the librarian of your local library requesting them to include more books and resources for competitive exams in the library's collection. (150 words)"
            }
        ]
    },
    {
        "set_name": "SSC CGL Set 4",
        "difficulty_type": "easy",
        "task_type": "descriptive",
        "data": [
            {
                "question": "Write an essay on 'Value of Time in Life'. (250 words)"
            },
            {
                "question": "You are Ajay/Priya, a resident of Green Avenue, Pune. Write a letter to the municipal officer, complaining about the irregular water supply in your area. (150 words)"
            }
        ]
    },
    {
        "set_name": "SSC CGL Set 4",
        "difficulty_type": "medium",
        "task_type": "descriptive",
        "data": [
            {
                "question": "Write an essay on 'Pros and Cons of Social Media'. (250 words)"
            },
            {
                "question": "Precis this passage in 100-150 words: Education is often regarded as the backbone of a nation's progress. It empowers individuals to make informed decisions, improves employability, and fosters critical thinking. Education systems worldwide aim to nurture creativity and innovation while promoting equality and inclusivity. However, challenges like inadequate infrastructure, high dropout rates, and outdated curricula persist. To address these, governments must invest in teacher training, technology in classrooms, and scholarships for the underprivileged. Education not only benefits individuals but also uplifts entire communities, paving the way for sustainable development."
            }
        ]
    },
    {
        "set_name": "SSC CGL Set 4",
        "difficulty_type": "hard",
        "task_type": "descriptive",
        "data": [
            {
                "question": "Write an essay on 'Is Privatization Beneficial for India's Economy?'. (250 words)"
            },
            {
                "question": "You are Neeraj/Shruti, recently employed at a new company. Write a letter to your HR manager requesting a change in your reporting date due to personal reasons. (150 words)"
            }
        ]
    },
    {
        "set_name": "SSC CGL Set 5",
        "difficulty_type": "easy",
        "task_type": "descriptive",
        "data": [
            {
                "question": "Write an essay on 'Importance of Cleanliness in Our Lives'. (250 words)"
            },
            {
                "question": "You are Rohan/Simran, a resident of Rajendra Nagar, Patna. Write a letter to your friend advising them on how to prepare for government exams effectively. (150 words)"
            }
        ]
    },
    {
        "set_name": "SSC CGL Set 5",
        "difficulty_type": "medium",
        "task_type": "descriptive",
        "data": [
            {
                "question": "Write an essay on 'Digital India: Bridging the Urban-Rural Divide'. (250 words)"
            },
            {
                "question": "Precis this passage in 100-150 words: Health is a fundamental human right and a key aspect of human development. Accessible healthcare ensures a productive workforce and fosters economic growth. While developed nations have robust healthcare systems, many developing countries struggle with inadequate infrastructure, lack of funding, and shortage of medical professionals. The COVID-19 pandemic highlighted the urgent need for global cooperation and investment in healthcare systems. Governments must prioritize preventive care, universal health coverage, and public health education to ensure better health outcomes for all."
            }
        ]
    },
    {
        "set_name": "SSC CGL Set 5",
        "difficulty_type": "hard",
        "task_type": "descriptive",
        "data": [
            {
                "question": "Write an essay on 'The Role of Artificial Intelligence in Modern Society'. (250 words)"
            },
            {
                "question": "You are Aarti/Manish, a bank employee. Write a letter to your branch manager requesting a transfer to your hometown branch due to family responsibilities. (150 words)"
            }
        ]
    },
    {
        "set_name": "SSC CGL Set 6",
        "difficulty_type": "easy",
        "task_type": "descriptive",
        "data": [
            {
                "question": "Write an essay on 'The Importance of Clean Drinking Water for Public Health' (250 words)."
            },
            {
                "question": "Write a letter to the editor of a local newspaper highlighting the problem of garbage disposal in your area and suggesting solutions. (150 words)"
            }
        ]
    },
    {
        "set_name": "SSC CGL Set 6",
        "difficulty_type": "medium",
        "task_type": "descriptive",
        "data": [
            {
                "question": "Write an essay on 'Balancing Economic Growth and Environmental Conservation' (250 words)."
            },
            {
                "question": "Write a letter to your school principal requesting the introduction of digital classrooms to improve learning methods. (150 words)"
            }
        ]
    },
    {
        "set_name": "SSC CGL Set 6",
        "difficulty_type": "hard",
        "task_type": "descriptive",
        "data": [
            {
                "question": "Write an essay on 'Artificial Intelligence: Opportunities and Challenges for India' (250 words)."
            },
            {
                "question": "Precis this passage in 100-150 words: Poverty is not just the absence of wealth but also a lack of access to basic amenities such as education, healthcare, and housing. In India, the cycle of poverty often perpetuates itself due to systemic issues, including poor governance and social inequality. Effective poverty alleviation requires comprehensive policies focusing on empowerment, skill development, and equitable distribution of resources."
            }
        ]
    },
    {
        "set_name": "SSC CGL Set 7",
        "difficulty_type": "easy",
        "task_type": "descriptive",
        "data": [
            {
                "question": "Write an essay on 'Role of Women in Nation Building' (250 words)."
            },
            {
                "question": "Write a letter to your younger sister advising her on the importance of time management in achieving success. (150 words)"
            }
        ]
    },
    {
        "set_name": "SSC CGL Set 7",
        "difficulty_type": "medium",
        "task_type": "descriptive",
        "data": [
            {
                "question": "Write an essay on 'Impact of Social Media on Youth' (250 words)."
            },
            {
                "question": "Write a letter to the District Magistrate requesting stricter measures for the safety of women in public places. (150 words)"
            }
        ]
    },
    {
        "set_name": "SSC CGL Set 7",
        "difficulty_type": "hard",
        "task_type": "descriptive",
        "data": [
            {
                "question": "Write an essay on 'Globalization and Its Effect on Cultural Diversity' (250 words)."
            },
            {
                "question": "Precis this passage in 100-150 words: Democracy is not just about the majority rule; it encompasses protecting the rights of minorities, ensuring freedom of expression, and fostering participation in governance. True democracy thrives when there is accountability, transparency, and equitable opportunities for all citizens, irrespective of their socio-economic backgrounds."
            }
        ]
    },
    {
        "set_name": "SSC CGL Set 8",
        "difficulty_type": "easy",
        "task_type": "descriptive",
        "data": [
            {
                "question": "Write an essay on 'The Benefits of Physical Fitness in Daily Life' (250 words)."
            },
            {
                "question": "Write a letter to your friend explaining the advantages of adopting a healthy lifestyle. (150 words)"
            }
        ]
    },
    {
        "set_name": "SSC CGL Set 8",
        "difficulty_type": "medium",
        "task_type": "descriptive",
        "data": [
            {
                "question": "Write an essay on 'The Role of Renewable Energy in India's Development' (250 words)."
            },
            {
                "question": "Precis this passage in 100-150 words: Technology has drastically reshaped modern society, influencing communication, education, and healthcare. However, over-reliance on technology poses risks, such as diminished face-to-face interactions and potential job losses due to automation. A balanced approach is essential to harness technology's benefits while mitigating its adverse effects."
            }
        ]
    },
    {
        "set_name": "SSC CGL Set 8",
        "difficulty_type": "hard",
        "task_type": "descriptive",
        "data": [
            {
                "question": "Write an essay on 'Is Freedom of Speech Absolute? Analyzing Its Boundaries in a Democracy' (250 words)."
            },
            {
                "question": "Write a letter to the Chief Minister of your state, suggesting steps to improve the quality of public transportation. (150 words)"
            }
        ]
    },
    {
        "set_name": "SSC CGL Set 9",
        "difficulty_type": "easy",
        "task_type": "descriptive",
        "data": [
            {
                "question": "Write an essay on 'Importance of Tree Plantation for a Sustainable Future' (250 words)."
            },
            {
                "question": "Write a letter to the librarian of your local library, requesting them to include more books on competitive exams preparation. (150 words)"
            }
        ]
    },
    {
        "set_name": "SSC CGL Set 9",
        "difficulty_type": "medium",
        "task_type": "descriptive",
        "data": [
            {
                "question": "Write an essay on 'The Growing Importance of Data Privacy in the Digital Age' (250 words)."
            },
            {
                "question": "Precis this passage in 100-150 words: Urbanization has led to significant advancements in infrastructure, lifestyle, and economic opportunities. However, it has also contributed to environmental degradation, increased traffic congestion, and stress among individuals. Sustainable urban planning is crucial to address these challenges and enhance the quality of life in cities."
            }
        ]
    },
    {
        "set_name": "SSC CGL Set 9",
        "difficulty_type": "hard",
        "task_type": "descriptive",
        "data": [
            {
                "question": "Write an essay on 'Should Capital Punishment Be Abolished? Arguments For and Against' (250 words)."
            },
            {
                "question": "Write a letter to your senior inquiring about career prospects in government services and seeking guidance on preparation strategies. (150 words)"
            }
        ]
    },
    {
        "set_name": "SSC CGL Set 10",
        "difficulty_type": "easy",
        "task_type": "descriptive",
        "data": [
            {
                "question": "Precis this passage in 100-150 words: A nation's strength lies not only in its military might but also in the education and empowerment of its citizens. True patriotism involves contributing to the country's growth through honesty, dedication, and hard work. Every individual has a role to play in building a progressive and harmonious society."
            },
            {
                "question": "Write a letter to your younger sibling advising them on the benefits of adopting reading as a daily habit. (150 words)"
            }
        ]
    },
    {
        "set_name": "SSC CGL Set 10",
        "difficulty_type": "medium",
        "task_type": "descriptive",
        "data": [
            {
                "question": "Write an essay on 'The Role of Artificial Intelligence in Modern Healthcare' (250 words)."
            },
            {
                "question": "Write a letter to the municipal corporation suggesting measures to improve the cleanliness and hygiene in your city. (150 words)"
            }
        ]
    },
    {
        "set_name": "SSC CGL Set 10",
        "difficulty_type": "hard",
        "task_type": "descriptive",
        "data": [
            {
                "question": "Write an essay on 'Is Universal Basic Income the Answer to Address Economic Inequality?' (250 words)."
            },
            {
                "question": "Write a letter to your company's HR manager requesting flexibility in working hours to pursue higher education alongside your job. (150 words)"
            }
        ]
    }
]